Courses/4420/Lectures/BufferOverflow/Labs00/bufovf-lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-24 Thu 13:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab on Buffer Overflow Exploits</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> 2018-10-18
</div>
<div id="content">
<h1 class="title">Lab on Buffer Overflow Exploits</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge60c32c">1. Background Knowledge</a></li>
<li><a href="#org3ad1755">2. Tasks</a>
<ul>
<li><a href="#orgc61c091">2.1. Task: GCC Should Not Complain [10 + 15 points]</a></li>
<li><a href="#orgd3774a0">2.2. Task: Size Reduction [25 points]</a></li>
<li><a href="#org4b189a6">2.3. Task: Experience the Exploit [5 * 5 points]</a></li>
<li><a href="#org2bf95da">2.4. Task: Current Buffer Overflow Exploits [25 points]</a></li>
</ul>
</li>
<li><a href="#org254ddc3">3. Tasks: [Bonus][Optional]</a></li>
<li><a href="#org8b7fc36">4. Submission</a></li>
<li><a href="#org2e889b2">5. References</a></li>
<li><a href="#orgbb48cfe">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge60c32c" class="outline-2">
<h2 id="orge60c32c"><span class="section-number-2">1</span> Background Knowledge</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Bash: What is the "prompt string"?  How do you change it?  What is
the "environment"?  How does one process pass it to the next?  What
does <code>system("/bin/bash")</code> do?  What else can we substitute instead
of "/bin/bash"?  Why does <code>exploit[34].c</code> run <code>system("/bin/bash")</code> at
the end of <code>main()</code>?</li>

<li>"A modern Linux" used below refers to a Linux installation from a
distribution released in the last 12 months.  Identify its details
in the equipment used section.</li>

<li>There are now (201x) many preventive measures in place that the
AlephOne's <code>exploit[34]</code> no longer works in modern Linux
installations.  But, you can run an older distro, such as Auditor
2008, and experience the exploit.  <a href="./Auditor/vm-setup.html">./Auditor/vm-setup.html</a>
describes a setup using <a href="./Auditor/auditor-250405-01.iso">./Auditor/auditor-250405-01.iso</a>, from the
same group that develops Kali Linux.</li>

<li>Even though the sentences "Interpret the results." and "Report your
findings." are explicitly stated a few times below, it is implicit
in all of this lab.</li>

<li>Answers to the above need not be included in the Lab Report.</li>

<li>Only Task 2.3 Subtask 3, as-was, depends on Auditor.  All other
tasks can be done under a modern 64-bit or 32-but distro.  The new
version of 2.3.3 asks to use a modern Linux.</li>
</ol>
</div>
</div>

<div id="outline-container-org3ad1755" class="outline-2">
<h2 id="org3ad1755"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
<p>
Objective: Understand the stack smashing buffer exploit thoroughly.
</p>
</div>

<div id="outline-container-orgc61c091" class="outline-3">
<h3 id="orgc61c091"><span class="section-number-3">2.1</span> Task: GCC Should Not Complain [10 + 15 points]</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Improve the source code of <code>exploit3.c</code> and <code>exploit4.c</code> of
AlephOne so that there are no warning messages from <code>gcc</code> even
after using the <code>gcc -ansi -pedantic -Wall</code> flags.  This implies
replacing asm-coding of <code>get_sp()</code> with plain C code.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd3774a0" class="outline-3">
<h3 id="orgd3774a0"><span class="section-number-3">2.2</span> Task: Size Reduction [25 points]</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Reduce the size of their [ <code>exploit3.c</code> and <code>exploit4.c</code> ] compiled
and linked binaries by at least 5% as seen by the <code>size</code> command
when exactly the same flags are used in the compilation.  Make sure
no functionality is lost. E.g., do not just remove <code>printf</code>'s.  Not
easy.  Do your best.  Document your effort.</li>

<li>Thoroughly describe your changes, and how you verified that there
was no loss of functionality.  Include properly indented versions
of your <code>exploit*.c</code> files.  Use <code>indent -kr</code>.</li>

<li>Real goal of this task is to study the code thoroughly.</li>
</ol>
</div>
</div>

<div id="outline-container-org4b189a6" class="outline-3">
<h3 id="org4b189a6"><span class="section-number-3">2.3</span> Task: Experience the Exploit [5 * 5 points]</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="./modret/modReturnAddress-acer602-20080507.html">modReturnAddress-acer602-20080507.html</a> is a record of notes taken
in Auditor running on my old Acer TravelMate 602TER laptop.
Produce a (similar) record of notes of running modret.c on a modern
Linux.  Interpret (differences in) the  results.</li>

<li>See if the <code>exploit3</code> works on the <code>vulnerable</code> program in a modern
Linux.  Login as a non-root user.  Interpret the results.</li>

<li>Exploit an suid-root program found within <del>Auditor</del> a modern Linux.
Use either <code>exploit3</code> or <code>exploit4</code>.  Exclude <code>xterm</code>.  Try at
least two suid-root programs.  Report your findings.  [After ASLR,
ROP etc. lectures, we will return to this topic of "experiencing a
buffer overflow exploit".]</li>

<li>Do the above within a modern Linux.  Most likely you will not
succeed.  Nevertheless, report your findings.</li>

<li>Can we "somehow" make <code>testsc.c</code> work in a modern Linux?  Report
your findings.</li>
</ol>
</div>
</div>

<div id="outline-container-org2bf95da" class="outline-3">
<h3 id="org2bf95da"><span class="section-number-3">2.4</span> Task: Current Buffer Overflow Exploits [25 points]</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Search the web and report on at least two recent (within last 12
months) buffer overflow exploits/ attacks.  Recall that there are
alternate names for this exploit.  The report should be technically
deeper than what you may find on CNN, <a href="https://www.cnet.com/">https://www.cnet.com/</a>, etc.
Aim for the level at least that of typical articles of
<a href="https://arstechnica.com/">https://arstechnica.com/</a>.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org254ddc3" class="outline-2">
<h2 id="org254ddc3"><span class="section-number-2">3</span> Tasks: [Bonus][Optional]</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>[25 points] Take an exploit reported above.  Study its CVE.  Demo
that the exploit works on a Linux installation of a recent (say,
last 24 months) distro.</li>
</ol>
</div>
</div>

<div id="outline-container-org8b7fc36" class="outline-2">
<h2 id="org8b7fc36"><span class="section-number-2">4</span> Submission</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Lab L4 Grading Sheet is superseded by this document.  Point
assignments are shown in brackets.  There are bonus points for a
"job well done" even if you skipped the bonus tasks.</li>

<li>You must follow the Lab Report Template. There should be a section
on each of the tasks, and subsections on sub-tasks.  Include a
couple of lines of an answer to each (implied/ explicit) question/
discussion item.  Must number it as in this document.</li>

<li>Use good judgement and do not make the report way longer than, say,
20 pages. Submit explanations and code that verifies your answers.</li>

<li>Include a journal.  By the hour.</li>

<li>This lab requires revisions of a few given source code
files. Include the revised versions in L4.tbz.</li>

<li>Submit a PDF file named exactly <code>Report-L4.pdf</code>, and a tarball
<code>L4.tbz</code> [use <code>tar cfjvv L4.tbz source-files*</code> ]. (Scripts are used
to check various things &#x2013; so file names should obey such "rules".)</li>
</ol>
</div>
</div>

<div id="outline-container-org2e889b2" class="outline-2">
<h2 id="org2e889b2"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, Lecture Notes on Buffer Overflow, 2018.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbb48cfe" class="outline-2">
<h2 id="orgbb48cfe"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-10-18
</div>
</body>
</html>
